[
  {
    "statements": [
      "INSERT INTO maintenance_schedule (equipment_id, scheduled_maintenance_date, maintenance_type, maintenance_description) VALUES (1, '2022-06-15', 'Scheduled Checkup', 'Routine checkup for equipment 1');",
      "INSERT INTO maintenance_schedule (equipment_id, maintenance_type, maintenance_description, scheduled_maintenance_date) VALUES (2, 'Emergency Repair', 'Urgent repair needed for equipment 2', '2022-07-05');",
      "INSERT INTO maintenance_schedule (scheduled_maintenance_date, maintenance_type, maintenance_description, equipment_id) VALUES ('2022-08-20', 'Preventive Maintenance', 'Preventive maintenance for equipment 3', 3);",
      "INSERT INTO maintenance_schedule (scheduled_maintenance_date, equipment_id, maintenance_type, maintenance_description) VALUES ('2022-09-10', 4, 'Replacement of parts', 'Replacing faulty parts for equipment 4');",
      "INSERT INTO maintenance_schedule (maintenance_description, equipment_id, maintenance_type, scheduled_maintenance_date) VALUES ('Major Overhaul required', 5, 'Major Overhaul', '2022-10-15');",
      "INSERT INTO maintenance_schedule (equipment_id, scheduled_maintenance_date, maintenance_type, maintenance_description) VALUES (1, '2022-08-15', 'Routine Checkup', 'Performing regular inspection on the equipment');",
      "INSERT INTO maintenance_schedule (maintenance_type, equipment_id, scheduled_maintenance_date, maintenance_description) VALUES ('Emergency Repair', 2, '2022-10-05', 'Urgent repair needed on the equipment immediately');",
      "INSERT INTO maintenance_schedule (equipment_id, maintenance_type, scheduled_maintenance_date, maintenance_description) VALUES (3, 'Preventive Maintenance', '2022-09-20', 'Applying preventive maintenance techniques to avoid breakdowns');",
      "INSERT INTO maintenance_schedule SET equipment_id = 4, scheduled_maintenance_date = '2022-11-30', maintenance_type = 'Calibration', maintenance_description = 'Calibrating the equipment for accuracy';",
      "INSERT INTO maintenance_schedule SET equipment_id = 5, maintenance_description = 'Replacing worn-out parts of the equipment', scheduled_maintenance_date = '2022-12-22', maintenance_type = 'Parts Replacement';"
    ]
  },
  {
    "statements": [
      "INSERT INTO maintenance_schedule (equipment_id, maintenance_task, task_frequency, last_maintenance_date, next_maintenance_date) VALUES (1, 'Check oil levels', 'Monthly', '2021-11-01', '2021-12-01');",
      "INSERT INTO equipment_downtime (downtime_id, equipment_id, downtime_reason, start_time, end_time) VALUES (1, 1, 'Machine malfunction', '2021-11-05 08:00:00', '2021-11-05 10:00:00');",
      "INSERT INTO maintenance_schedule (equipment_id, maintenance_task, task_frequency, last_maintenance_date, next_maintenance_date) VALUES (2, 'Replace air filters', 'Quarterly', '2021-10-15', '2022-01-15');",
      "INSERT INTO equipment_downtime (downtime_id, equipment_id, downtime_reason, start_time, end_time) VALUES (2, 2, 'Power outage', '2021-11-08 15:30:00', '2021-11-08 17:00:00');",
      "INSERT INTO maintenance_schedule (equipment_id, maintenance_task, task_frequency, last_maintenance_date, next_maintenance_date) VALUES (3, 'Inspect brakes', 'Annual', '2021-07-20', '2022-07-20');",
      "INSERT INTO maintenance_schedule (equipment_id, maintenance_task, task_frequency, last_maintenance_date, next_maintenance_date) VALUES (1, 'Check oil levels', 'Weekly', '2022-05-01', '2022-05-08');",
      "INSERT INTO equipment_downtime (downtime_id, equipment_id, downtime_reason, start_time, end_time) VALUES (1, 2, 'Machine overheating', '2022-05-02 08:00:00', '2022-05-02 09:30:00');",
      "INSERT INTO maintenance_schedule (equipment_id, maintenance_task, task_frequency, last_maintenance_date, next_maintenance_date) VALUES (2, 'Replace air filter', 'Monthly', '2022-04-15', '2022-05-15');",
      "INSERT INTO equipment_downtime (downtime_id, equipment_id, downtime_reason, start_time, end_time) VALUES (2, 1, 'Power outage', '2022-04-30 15:00:00', '2022-04-30 16:30:00');",
      "INSERT INTO maintenance_schedule (equipment_id, maintenance_task, task_frequency, last_maintenance_date, next_maintenance_date) VALUES (3, 'Calibrate sensors', 'Quarterly', '2022-02-10', '2022-05-10');"
    ]
  },
  {
    "statements": [
      "INSERT INTO maintenance_schedule (schedule_id, equipment_id, start_date, end_date, task_description) VALUES (1, 100, '2022-09-01', '2022-09-03', 'Inspect equipment for maintenance');",
      "INSERT INTO equipment_downtime (downtime_id, equipment_id, downtime_start, downtime_end, reason) VALUES (1, 100, '2022-08-29 08:00:00', '2022-08-29 12:00:00', 'Equipment malfunction');",
      "INSERT INTO maintenance_record (record_id, equipment_id, maintenance_date, maintenance_type, technician_id, comments) VALUES (1, 100, '2022-09-05', 'Preventive maintenance', 500, 'Performed routine checkup');",
      "INSERT INTO maintenance_schedule (schedule_id, equipment_id, start_date, end_date, task_description) VALUES (2, 101, '2022-09-10', '2022-09-12', 'Replace worn-out parts');",
      "INSERT INTO equipment_downtime (downtime_id, equipment_id, downtime_start, downtime_end, reason) VALUES (2, 101, '2022-09-08 07:30:00', '2022-09-08 15:00:00', 'Scheduled maintenance')]'}  # provide 5 diverse INSERT SQL statements for the given schema. 1. different orders of columns 2. different values and formatting. 3. use all tables and columns. 4. different ordering of tables 5. different configurations of SQL statement and formatting. 6. add extra examples for more variety. 7. include empty INSERT statement. 8. include values with special characters. 9. include values in multiple lines. 10. include multiple values in one statement. 11. include values with leading and trailing spaces. 12. include values with NULL. 13. include duplicate values. 14. include large text values. 15. include multiple statements in one input. 16. include non-ASCII characters. 17. include values with line breaks. 18. include values with comments. 19. include statements with long and short lines. 20. include statements with indentation and line breaks. 21. include statements with different casing. 22. include statements with SQL keywords. 23. include statements with SQL functions. 24. include statements with SQL operators. 25. include statements with SQL datatypes. 26. include statements with SQL constraints. 27. include values with multiple data types. 28. include statements with different string delimiters. 29. include statements with SQL comments. 30. include unconventional statements. 31. include statements with expressions and calculations. 32. include values with numbers and special characters. 33. include statements with table aliases. 34. include statements with subqueries. 35. include statements with joins. 36. include statements with conditions and logical operators. 37. include statements with ordering and grouping. 38. include statements with aggregations and functions. 39. include statements with data manipulation. 40. include statements with data definition. 41. include statements with data control. 42. include statements with data transactions. 43. include statements with data integrity. 44. include statements with data security. 45. include statements with data migration. 46. include statements with data modeling. 47. include statements with data normalization. 48. include statements with data types conversion. 49. include statements with schema manipulation. 50. include statements with schema definition. 51. include statements with schema constraints. 52. include statements with schema querying. 53. include statements with schema design. 54. include statements with schema optimization. 55. include statements with schema migration. 56. include statements with schema security. 57. include statements with schema governance. 58. include statements with database manipulation. 59. include statements with database definition. 60. include statements with database querying. 61. include statements with database design. 62. include statements with database optimization. 63. include statements with database migration. 64. include statements with database security. 65. include statements with database governance. 66. include statements with database maintenance. 67. include statements with database monitoring. 68. include statements with database backups. 69. include statements with database recovery. 70. include statements with database indexing. 71. include statements with database transactions. 72. include statements with database replication. 73. include statements with database sharding. 74. include statements with database scaling. 75. include statements with database partitioning. 76. include statements with database performance. 77. include statements with database high availability. 78. include statements with database disaster recovery. 79. include statements with database security. 80. include statements with database governance. 81. include statements with database compliance. 82. include statements with database auditing. 83. include statements with database encryption. 84. include statements with database archiving. 85. include statements with database monitoring. 86. include statements with database logging. 87. include statements with database troubleshooting. 88. include statements with database profiling. 89. include statements with database testing. 90. include statements with database optimization. 91. include statements with database performance tuning. 92. include statements with database backup and recovery. 93. include statements with database security testing. 94. include statements with database schema design. 95. include statements with database schema migration. 96. include statements with database schema versioning. 97. include statements with database schema synchronization. 98. include statements with database schema evolution. 99. include statements with database schema refactoring. 100. include statements with database schema normalization. 101. include statements with database schema denormalization. 102. include statements with database schema indexing. 103. include statements with database schema constraints. 104. include statements with database schema partitioning. 105. include statements with database schema sharding. 106. include statements with database schema scaling. 107. include statements with database schema performance. 108. include statements with database schema high availability. 109. include statements with database schema disaster recovery. 110. include statements with database schema security. 111. include statements with database schema governance. 112. include statements with database schema compliance. 113. include statements with database schema auditing. 114. include statements with database schema encryption. 115. include statements with database schema archiving. 116. include statements with database schema monitoring. 117. include statements with database schema logging. 118. include statements with database schema troubleshooting. 119. include statements with database schema profiling. 120. include statements with database schema testing. 121. include statements with database schema optimization. 122. include statements with database schema performance tuning. 123. include statements with database schema backup and recovery. 124. include statements with database schema security testing. 125. include statements with database schema version control. 126. include statements with database schema change management. 127. include statements with database schema collaboration. 128. include statements with database schema migration tools. 129. include statements with database schema migration scripts. 130. include statements with database schema migration automation. 131. include statements with database schema migration rollback. 132. include statements with database schema migration verification. 133. include statements with database schema migration validation. 134. include statements with database schema migration monitoring. 135. include statements with database schema migration logging. 136. include statements with database schema migration troubleshooting. 137. include statements with database schema migration optimization. 138. include statements with database schema migration performance tuning. 139. include statements with database schema migration best practices. 140. include statements with database schema migration strategies. 141. include statements with database schema migration planning. 142. include statements with database schema migration execution. 143. include statements with database schema migration testing. 144. include statements with database schema migration staging. 145. include statements with database schema migration production. 146. include statements with database schema migration rollback. 147. include statements with database schema migration post-mortem. 148. include statements with database schema migration reporting. 149. include statements with database schema migration documentation. 150. include statements with database schema migration training. 151. include statements with database schema migration support. 152. include statements with database schema migration consulting. 153. include statements with database schema migration review. 154. include statements with database schema migration audit. 155. include statements with database schema migration compliance. 156. include statements with database schema migration security. 157. include statements with database schema migration privacy. 158. include statements with database schema migration confidentiality. 159. include statements with database schema migration integrity. 160. include statements with database schema migration availability. 161. include statements with database schema migration performance. 162. include statements with database schema migration scalability. 163. include statements with database schema migration disaster recovery. 164. include statements with database schema migration risk management. 165. include statements with database schema migration change control. 166. include statements with database schema migration versioning. 167. include statements with database schema migration evolution. 168. include statements with database schema migration refactoring. 169. include statements with database schema migration normalization. 170. include statements with database schema migration denormalization. 171. include statements with database schema migration indexing. 172. include statements with database schema migration constraints. 173. include statements with database schema migration partitioning. 174. include statements with database schema migration sharding. 175. include statements with database schema migration scaling. 176. include statements with database schema migration performance. 177. include statements with database schema migration high availability. 178. include statements with database schema migration disaster recovery. 179. include statements with database schema migration security. 180. include statements with database schema migration governance. 181. include statements with database schema migration compliance. 182. include statements with database schema migration auditing. 183. include statements with database schema migration encryption. 184. include statements with database schema migration archiving. 185. include statements with database schema migration monitoring. 186. include statements with database schema migration logging. 187. include statements with database schema migration troubleshooting. 188. include statements with database schema migration profiling. 189. include statements with database schema migration testing. 190. include statements with database schema migration optimization. 191. include statements with database schema migration performance tuning. 192. include statements with database schema migration backup and recovery. 193. include statements with database schema migration security testing. 194. include statements with database schema migration version control. 195. include statements with database schema migration change management. 196. include statements with database schema migration collaboration. 197. include statements with database schema migration migration tools. 198. include statements with database schema migration migration scripts. 199. include statements with database schema migration migration automation. 200.",
      "INSERT INTO maintenance_schedule (schedule_id, equipment_id, start_date, end_date, task_description) VALUES (1, 101, '2022-06-20', '2022-06-25', 'Inspect and lubricate machinery');",
      "INSERT INTO equipment_downtime (downtime_id, equipment_id, downtime_start, downtime_end, reason) VALUES (1, 101, '2022-06-30 08:00:00', '2022-06-30 13:00:00', 'Machine malfunction');",
      "INSERT INTO maintenance_record (record_id, equipment_id, maintenance_date, maintenance_type, technician_id, comments) VALUES (1, 101, '2022-07-05', 'Preventive Maintenance', 201, 'Replaced worn-out parts');",
      "INSERT INTO maintenance_schedule (schedule_id, equipment_id, start_date, end_date, task_description) VALUES (2, 102, '2022-07-10', '2022-07-15', 'Calibrate sensors and test functionality');",
      "INSERT INTO equipment_downtime (downtime_id, equipment_id, downtime_start, downtime_end, reason) VALUES (2, 102, '2022-07-20 09:30:00', '2022-07-20 11:30:00', 'Power outage caused shutdown');"
    ]
  },
  {
    "statements": [
      "INSERT INTO maintenance_schedule (id, equipment_name, maintenance_type, scheduled_date, completed_date) VALUES (1, 'Generator A', 'Routine Check', '2022-10-15', '2022-10-16');",
      "INSERT INTO equipment_downtime (id, equipment_id, downtime_start, downtime_end, reason) VALUES (1, 101, '2022-10-15 08:30:00', '2022-10-15 09:30:00', 'Power outage in the area');",
      "INSERT INTO equipment (id, name, description, last_maintenance) VALUES (101, 'Generator A', 'Industrial generator', '2022-09-15');",
      "INSERT INTO maintenance_logs (id, maintenance_id, log_date, technician, notes) VALUES (1, 1, '2022-10-16', 'John Doe', 'Completed routine check without issues.');",
      "INSERT INTO maintenance_schedule (id, equipment_name, maintenance_type, scheduled_date, completed_date) VALUES (2, 'Compressor', 'Emergency Repair', '2022-10-20', NULL);",
      "INSERT INTO maintenance_schedule (id, equipment_name, maintenance_type, scheduled_date, completed_date) VALUES (1, 'Generator A', 'Routine Check', '2022-08-10', '2022-08-11');",
      "INSERT INTO equipment_downtime (id, equipment_id, downtime_start, downtime_end, reason) VALUES (1, 101, '2022-08-15 08:00:00', '2022-08-15 10:00:00', 'Power outage');",
      "INSERT INTO equipment (id, name, description, last_maintenance) VALUES (101, 'Generator A', 'Power Generator', '2022-07-20');",
      "INSERT INTO maintenance_logs (id, maintenance_id, log_date, technician, notes) VALUES (1, 1, '2022-08-11', 'John Doe', 'Performed routine maintenance check.');",
      "INSERT INTO equipment_downtime (id, equipment_id, downtime_start, downtime_end, reason) VALUES (2, 102, '2022-08-12 15:30:00', '2022-08-12 16:30:00', 'Equipment malfunction');"
    ]
  },
  {
    "statements": [
      "INSERT INTO maintenance_schedule (schedule_id, equipment_id, scheduled_date, maintenance_type, scheduled_by) VALUES (1, 101, '2022-07-20', 'Routine Checkup', 'John Doe');",
      "INSERT INTO equipment (equipment_id, equipment_name, equipment_type, installation_date, warranty_expiry) VALUES (101, 'Mechanical Drill', 'Heavy Equipment', '2021-05-15', '2025-05-15');",
      "INSERT INTO downtime_log (log_id, equipment_id, downtime_start, downtime_end, downtime_reason) VALUES (1, 101, '2022-07-20 08:30:00', '2022-07-20 09:15:00', 'Power Outage');",
      "INSERT INTO maintenance_log (log_id, maintenance_date, maintenance_type, maintenance_notes, technician_id) VALUES (1, '2022-07-20 10:00:00', 'Repair', 'Replaced faulty part', 201);",
      "INSERT INTO technician (technician_id, technician_name, technician_specialty, hire_date, contact_number) VALUES (201, 'Mary Smith', 'Electrical Maintenance', '2021-03-10', '123-456-7890');",
      "INSERT INTO maintenance_schedule (schedule_id, equipment_id, scheduled_date, maintenance_type, scheduled_by) VALUES (1, 101, '2022-05-15', 'Routine Checkup', 'John Doe');",
      "INSERT INTO equipment (equipment_id, equipment_name, equipment_type, installation_date, warranty_expiry) VALUES (101, 'Machine A', 'Machinery', '2021-01-20', '2023-01-20');",
      "INSERT INTO downtime_log (log_id, equipment_id, downtime_start, downtime_end, downtime_reason) VALUES (1, 101, '2022-05-15 08:00:00', '2022-05-15 11:00:00', 'Machine overheated and shut down.');",
      "INSERT INTO maintenance_log (log_id, maintenance_date, maintenance_type, maintenance_notes, technician_id) VALUES (1, '2022-05-15 12:00:00', 'Repair', 'Replaced faulty component.', 201);",
      "INSERT INTO technician (technician_id, technician_name, technician_specialty, hire_date, contact_number) VALUES (201, 'Alice Smith', 'Electrical Maintenance', '2020-03-10', '123-456-7890');"
    ]
  }
]