{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "NFKC"
  },
  "pre_tokenizer": {
    "type": "Metaspace",
    "replacement": "▁",
    "add_prefix_space": true,
    "prepend_scheme": "always"
  },
  "post_processor": null,
  "decoder": {
    "type": "Metaspace",
    "replacement": "▁",
    "add_prefix_space": true,
    "prepend_scheme": "always"
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "<unk>": 0,
      "\b": 1,
      "\t": 2,
      "\n": 3,
      "\r": 4,
      "!": 5,
      "\"": 6,
      "#": 7,
      "$": 8,
      "%": 9,
      "&": 10,
      "'": 11,
      "(": 12,
      ")": 13,
      "*": 14,
      "+": 15,
      ",": 16,
      "-": 17,
      ".": 18,
      "/": 19,
      "0": 20,
      "1": 21,
      "2": 22,
      "3": 23,
      "4": 24,
      "5": 25,
      "6": 26,
      "7": 27,
      "8": 28,
      "9": 29,
      ":": 30,
      ";": 31,
      "<": 32,
      "=": 33,
      ">": 34,
      "?": 35,
      "@": 36,
      "A": 37,
      "B": 38,
      "C": 39,
      "D": 40,
      "E": 41,
      "F": 42,
      "G": 43,
      "H": 44,
      "I": 45,
      "J": 46,
      "K": 47,
      "L": 48,
      "M": 49,
      "N": 50,
      "O": 51,
      "P": 52,
      "Q": 53,
      "R": 54,
      "S": 55,
      "T": 56,
      "U": 57,
      "V": 58,
      "W": 59,
      "X": 60,
      "Y": 61,
      "Z": 62,
      "[": 63,
      "\\": 64,
      "]": 65,
      "^": 66,
      "_": 67,
      "`": 68,
      "a": 69,
      "b": 70,
      "c": 71,
      "d": 72,
      "e": 73,
      "f": 74,
      "g": 75,
      "h": 76,
      "i": 77,
      "j": 78,
      "k": 79,
      "l": 80,
      "m": 81,
      "n": 82,
      "o": 83,
      "p": 84,
      "q": 85,
      "r": 86,
      "s": 87,
      "t": 88,
      "u": 89,
      "v": 90,
      "w": 91,
      "x": 92,
      "y": 93,
      "z": 94,
      "{": 95,
      "|": 96,
      "}": 97,
      "~": 98,
      "¡": 99,
      "£": 100,
      "¥": 101,
      "°": 102,
      "¿": 103,
      "É": 104,
      "Ö": 105,
      "á": 106,
      "ã": 107,
      "ä": 108,
      "ç": 109,
      "è": 110,
      "é": 111,
      "ë": 112,
      "í": 113,
      "î": 114,
      "ñ": 115,
      "ó": 116,
      "ô": 117,
      "ö": 118,
      "÷": 119,
      "ø": 120,
      "ú": 121,
      "ü": 122,
      "ǎ": 123,
      "ǐ": 124,
      "̈": 125,
      "α": 126,
      "θ": 127,
      "μ": 128,
      "π": 129,
      "ψ": 130,
      "П": 131,
      "а": 132,
      "в": 133,
      "д": 134,
      "е": 135,
      "и": 136,
      "к": 137,
      "л": 138,
      "м": 139,
      "р": 140,
      "т": 141,
      "،": 142,
      "؟": 143,
      "ا": 144,
      "ب": 145,
      "ح": 146,
      "ر": 147,
      "ف": 148,
      "ك": 149,
      "ل": 150,
      "م": 151,
      "ي": 152,
      "​": 153,
      "‌": 154,
      "–": 155,
      "—": 156,
      "‘": 157,
      "’": 158,
      "€": 159,
      "₹": 160,
      "√": 161,
      "▁": 162,
      "☀": 163,
      "☕": 164,
      "⟩": 165,
      "、": 166,
      "。": 167,
      "お": 168,
      "か": 169,
      "こ": 170,
      "す": 171,
      "ち": 172,
      "で": 173,
      "に": 174,
      "の": 175,
      "は": 176,
      "を": 177,
      "ん": 178,
      "上": 179,
      "下": 180,
      "不": 181,
      "个": 182,
      "中": 183,
      "串": 184,
      "主": 185,
      "了": 186,
      "事": 187,
      "于": 188,
      "些": 189,
      "产": 190,
      "以": 191,
      "你": 192,
      "例": 193,
      "供": 194,
      "保": 195,
      "值": 196,
      "元": 197,
      "充": 198,
      "入": 199,
      "全": 200,
      "其": 201,
      "具": 202,
      "函": 203,
      "划": 204,
      "列": 205,
      "前": 206,
      "功": 207,
      "加": 208,
      "包": 209,
      "单": 210,
      "句": 211,
      "可": 212,
      "合": 213,
      "同": 214,
      "含": 215,
      "和": 216,
      "品": 217,
      "在": 218,
      "地": 219,
      "填": 220,
      "增": 221,
      "复": 222,
      "多": 223,
      "好": 224,
      "字": 225,
      "宣": 226,
      "将": 227,
      "序": 228,
      "应": 229,
      "式": 230,
      "性": 231,
      "成": 232,
      "据": 233,
      "描": 234,
      "提": 235,
      "插": 236,
      "数": 237,
      "文": 238,
      "日": 239,
      "明": 240,
      "更": 241,
      "有": 242,
      "期": 243,
      "本": 244,
      "机": 245,
      "杂": 246,
      "条": 247,
      "构": 248,
      "样": 249,
      "格": 250,
      "每": 251,
      "気": 252,
      "法": 253,
      "测": 254,
      "涵": 255,
      "生": 256,
      "用": 257,
      "的": 258,
      "盖": 259,
      "目": 260,
      "确": 261,
      "示": 262,
      "空": 263,
      "符": 264,
      "約": 265,
      "组": 266,
      "结": 267,
      "能": 268,
      "行": 269,
      "表": 270,
      "要": 271,
      "言": 272,
      "語": 273,
      "説": 274,
      "计": 275,
      "订": 276,
      "试": 277,
      "语": 278,
      "购": 279,
      "这": 280,
      "进": 281,
      "述": 282,
      "都": 283,
      "键": 284,
      "非": 285,
      "面": 286,
      "顺": 287,
      "风": 288,
      "️": 289,
      "�": 290,
      "🍕": 291,
      "🎉": 292,
      "💪": 293,
      "🔥": 294,
      "😀": 295,
      "😉": 296,
      "😊": 297,
      "😞": 298,
      "🙏": 299,
      ",\n": 300,
      "AR": 301,
      "TA": 302,
      "TE": 303,
      "NT": 304,
      "▁I": 305,
      "RE": 306,
      "LE": 307,
      "▁INT": 308,
      "ATE": 309,
      "BLE": 310,
      "▁TA": 311,
      "▁TABLE": 312,
      "▁(": 313,
      "##": 314,
      "IM": 315,
      "▁V": 316,
      "▁K": 317,
      "▁N": 318,
      "CH": 319,
      "CHAR": 320,
      "▁VAR": 321,
      "▁VARCHAR": 322,
      "EY": 323,
      ");": 324,
      "▁KEY": 325,
      "▁VARCHAR(": 326,
      "\n);": 327,
      "CRE": 328,
      "CREATE": 329,
      "▁(\n": 330,
      "▁P": 331,
      "▁PR": 332,
      "ARY": 333,
      "▁PRIM": 334,
      "▁PRIMARY": 335,
      "),\n": 336,
      "▁S": 337,
      "▁D": 338,
      "▁KEY,\n": 339,
      "▁##": 340,
      "▁###": 341,
      "\n\n": 342,
      "\n);\n\n": 343,
      "\n);\n\nCREATE": 344,
      "ES": 345,
      "UL": 346,
      "OT": 347,
      "▁NOT": 348,
      "ULL": 349,
      "▁NULL": 350,
      "▁_": 351,
      "50": 352,
      "▁INT,\n": 353,
      "AL": 354,
      "▁VARCHAR(50": 355,
      "▁NULL,\n": 356,
      "10": 357,
      "▁VARCHAR(2": 358,
      "▁U": 359,
      "ERE": 360,
      "▁F": 361,
      "ME": 362,
      "__": 363,
      "▁T": 364,
      "DA": 365,
      "55": 366,
      "MENT": 367,
      "▁STA": 368,
      "DATA": 369,
      "TEMENT": 370,
      "▁STATEMENT": 371,
      "▁TABLEDATA": 372,
      "▁CREATE": 373,
      "XT": 374,
      "▁'": 375,
      "▁VARCHAR(255": 376,
      "▁DATE": 377,
      "▁TE": 378,
      "▁TEXT": 379,
      "ER": 380,
      "NC": 381,
      "▁DE": 382,
      "▁W": 383,
      "▁VARCHAR(50),\n": 384,
      "ID": 385,
      "▁DATE,\n": 386,
      "▁UU": 387,
      "▁UUID": 388,
      "▁RE": 389,
      "▁TEXT,\n": 390,
      "▁REF": 391,
      "NCES": 392,
      "ERENCES": 393,
      "▁REFERENCES": 394,
      "MP": 395,
      "▁TIM": 396,
      "',": 397,
      "▁2": 398,
      "CIM": 399,
      "▁DECIM": 400,
      "▁DECIMAL": 401,
      "▁VARCHAR(10": 402,
      "ESTA": 403,
      "ESTAMP": 404,
      "▁TIMESTAMP": 405,
      "▁B": 406,
      "▁VARCHAR(50)": 407,
      "▁VARCHAR(255),\n": 408,
      "▁=": 409,
      "RO": 410,
      "▁1": 411,
      "▁VARCHAR(100": 412,
      "▁KEY\n);\n\nCREATE": 413,
      "▁WH": 414,
      "▁A": 415,
      "▁WHERE": 416,
      "▁SE": 417,
      "ROM": 418,
      "▁FROM": 419,
      "▁O": 420,
      "▁VARCHAR(255)": 421,
      "▁IN": 422,
      "00": 423,
      "▁J": 424,
      "CT": 425,
      "▁TIMESTAMP,\n": 426,
      "▁3": 427,
      "LO": 428,
      "▁t": 429,
      "AT": 430,
      "▁DECIMAL(": 431,
      "▁0": 432,
      "▁C": 433,
      "20": 434,
      "▁f": 435,
      "▁a": 436,
      "IAL": 437,
      "▁5": 438,
      "ERIAL": 439,
      "▁SERIAL": 440,
      "▁p": 441,
      "▁s": 442,
      "LECT": 443,
      "▁c": 444,
      "ERT": 445,
      "SERT": 446,
      "▁INSERT": 447,
      "▁SELECT": 448,
      "▁INTO": 449,
      "ALU": 450,
      "ALUES": 451,
      "▁VALUES": 452,
      "▁4": 453,
      "▁L": 454,
      "▁G": 455,
      "▁i": 456,
      "-0": 457,
      "▁d": 458,
      "▁r": 459,
      "▁FLO": 460,
      "▁FLOAT": 461,
      "▁e": 462,
      "▁8": 463,
      "▁7": 464,
      "▁m": 465,
      "▁E": 466,
      "▁o": 467,
      "▁6": 468,
      "▁u": 469,
      "▁Y": 470,
      "▁M": 471,
      "▁w": 472,
      "▁l": 473,
      "▁n": 474,
      "▁H": 475,
      "▁9": 476,
      "▁b": 477,
      "▁v": 478,
      "▁h": 479,
      "▁g": 480,
      "▁R": 481,
      "▁y": 482,
      "▁q": 483,
      "▁k": 484,
      "▁j": 485,
      "▁x": 486,
      "▁Q": 487,
      "▁z": 488,
      "▁X": 489,
      "▁Z": 490,
      "10,": 491,
      "▁DECIMAL(10,": 492,
      "▁VARCHAR(100),\n": 493,
      "▁INT\n);\n\nCREATE": 494,
      "22": 495,
      "▁NULL\n);\n\nCREATE": 496,
      "▁VARCHAR(100)": 497,
      "▁'20": 498,
      "▁KEY\n);": 499,
      "k_": 500,
      "l_": 501,
      "e_": 502,
      "▁FLOAT,\n": 503,
      "n_": 504,
      "t_": 505,
      "r_": 506,
      "g_": 507,
      "x_": 508,
      "m_": 509,
      "d_": 510,
      "y_": 511,
      "w_": 512,
      "IN": 513,
      "G_": 514,
      "a_": 515,
      "b_": 516,
      "p_": 517,
      "q_": 518,
      "h_": 519,
      "V_": 520,
      "s_": 521,
      "J_": 522,
      "F_": 523,
      "f_": 524,
      "o_": 525,
      "z_": 526,
      "j_": 527,
      "c_": 528,
      "8_": 529,
      "Q_": 530,
      "7_": 531,
      "W_": 532,
      "3_": 533,
      "X_": 534,
      "9_": 535,
      "6_": 536,
      "I_": 537,
      "u_": 538,
      "1_": 539,
      "B_": 540,
      "4_": 541,
      "v_": 542,
      "K_": 543,
      "U_": 544,
      "i_": 545,
      "Z_": 546,
      "S_": 547,
      "H_": 548,
      "C_": 549,
      "2_": 550,
      "M_": 551,
      "Y_": 552,
      "N_": 553,
      "5_": 554,
      "D_": 555,
      "P_": 556,
      "O_": 557,
      "A_": 558,
      "L_": 559,
      "▁DECIMAL,\n": 560,
      "R_": 561,
      "▁'2022": 562,
      "1,": 563,
      "0_": 564,
      ")\n);\n\nCREATE": 565,
      "E_": 566,
      "T_": 567,
      "15": 568,
      "RU": 569,
      "-01": 570,
      "PD": 571,
      "▁10": 572,
      "▁BY": 573,
      "er": 574,
      "▁VARCHAR(20": 575,
      "');": 576,
      "▁VARCHAR,\n": 577,
      "12": 578,
      "RD": 579,
      "le": 580,
      "TR": 581,
      "in": 582,
      "on": 583,
      "▁VARCHAR(50)\n);\n\nCREATE": 584,
      "45": 585,
      "at": 586,
      "▁TRU": 587,
      "OO": 588,
      "▁TEXT\n);\n\nCREATE": 589,
      "LETE": 590,
      "▁DELETE": 591,
      "AN": 592,
      "en": 593,
      "▁2),\n": 594,
      "▁INT\n);": 595,
      "';": 596,
      "▁SET": 597,
      "NCATE": 598,
      "▁TRUNCATE": 599,
      "PDATE": 600,
      "▁UPDATE": 601,
      "▁NULL\n);": 602,
      "▁DATE\n);\n\nCREATE": 603,
      "or": 604,
      "▁(1,": 605,
      "it": 606,
      "om": 607,
      "ic": 608,
      "▁UUID,\n": 609,
      "an": 610,
      ":00": 611,
      "es": 612,
      "ING": 613,
      "ND": 614,
      "▁ORD": 615,
      "▁ORDER": 616,
      "▁VARCHAR(255)\n);\n\nCREATE": 617,
      "am": 618,
      "IQ": 619,
      "ed": 620,
      "UE": 621,
      "TRING": 622,
      "▁STRING": 623,
      "ar": 624,
      "oh": 625,
      "5,": 626,
      "al": 627,
      "▁BOO": 628,
      "▁VARCHAR(20),\n": 629,
      "ON": 630,
      "▁('": 631,
      "LEAN": 632,
      "▁BOOLEAN": 633,
      "89": 634,
      "-4": 635,
      "▁__": 636,
      "▁*": 637,
      "ct": 638,
      "oe": 639,
      "SC": 640,
      "30": 641,
      "ro": 642,
      "67": 643,
      "▁>": 644,
      "ex": 645,
      ")\n);": 646,
      "23": 647,
      "ESC": 648,
      "▁DESC": 649,
      "2,": 650,
      "▁DECIMAL(10,2": 651,
      "▁'2022-01": 652,
      "▁'2022-0": 653,
      "re": 654,
      "17": 655,
      "▁STRING,\n": 656,
      "66": 657,
      "▁AND": 658,
      "▁UN": 659,
      "21": 660,
      "ou": 661,
      "▁VARCHAR(50)\n);": 662,
      "d3": 663,
      "14": 664,
      "IQUE": 665,
      "▁UNIQUE": 666,
      "▁TEXT\n);": 667,
      "as": 668,
      "IG": 669,
      "ew": 670,
      "is": 671,
      "ot": 672,
      "▁1;": 673,
      "▁TIMESTAMP\n);\n\nCREATE": 674,
      "-15": 675,
      "em": 676,
      "et": 677,
      "ch": 678,
      "▁VARCHAR(10),\n": 679,
      "il": 680,
      "▁DATE\n);": 681,
      "▁VARCHAR(255)\n);": 682,
      "FA": 683,
      "▁BOOLEAN,\n": 684,
      "▁VARCHAR(15": 685,
      "___": 686,
      "11": 687,
      "iv": 688,
      "ab": 689,
      "ol": 690,
      "99": 691,
      "3e": 692,
      "ag": 693,
      "nt": 694,
      "OU": 695,
      "el": 696,
      "ad": 697,
      "ig": 698,
      "IK": 699,
      "16": 700,
      "us": 701,
      "▁JS": 702,
      "ohn": 703,
      "▁DESC;": 704,
      "ce": 705,
      "ur": 706,
      "Al": 707,
      "87": 708,
      "UM": 709,
      "UP": 710,
      "▁2)": 711,
      "▁(_": 712,
      "DE": 713,
      "um": 714,
      "18": 715,
      "ion": 716,
      "▁JSON": 717,
      "os": 718,
      "pp": 719,
      "31": 720,
      "du": 721,
      "IT": 722,
      "IS": 723,
      "▁INTE": 724,
      "ec": 725,
      "ac": 726,
      "pt": 727,
      "ow": 728,
      "25": 729,
      "▁50": 730,
      "65": 731,
      "im": 732,
      "01": 733,
      "og": 734,
      "WE": 735,
      "44": 736,
      "▁VARCHAR(100)\n);\n\nCREATE": 737,
      "ob": 738,
      "ff": 739,
      "▁ON": 740,
      "ut": 741,
      "-12": 742,
      "ET": 743,
      "ul": 744,
      "ple": 745,
      "ay": 746,
      "')": 747,
      "a7": 748,
      "od": 749,
      "TZ": 750,
      "▁TIME": 751,
      "nd": 752,
      "43": 753,
      "▁1,": 754,
      "oc": 755,
      "▁DECIMAL(10,2),\n": 756,
      "19": 757,
      "ef": 758,
      "EN": 759,
      "com": 760,
      "ir": 761,
      "ue": 762,
      "pd": 763,
      "id": 764,
      "34": 765,
      "75": 766,
      "cc": 767,
      "80": 768,
      "if": 769,
      "9b": 770,
      "av": 771,
      "st": 772,
      "RV": 773,
      "33": 774,
      "(_": 775,
      "In": 776,
      "eg": 777,
      "8b": 778,
      "ht": 779,
      "AV": 780,
      "2b": 781,
      "pl": 782,
      "6b": 783,
      "ng": 784,
      "ing": 785,
      "85": 786,
      "SE": 787,
      "-10": 788,
      "sm": 789,
      "ev": 790,
      "St": 791,
      "84": 792,
      "8f": 793,
      "Ch": 794,
      "GER": 795,
      "op": 796,
      "AP": 797,
      "1b": 798,
      "af": 799,
      "8d": 800,
      "a0": 801,
      "cr": 802,
      "6f": 803,
      "90": 804,
      "▁INTEGER": 805,
      "77": 806,
      "iz": 807,
      "VG": 808,
      "ak": 809,
      "BC": 810,
      "60": 811,
      "th": 812,
      "▁JO": 813,
      "64": 814,
      "a4": 815,
      "1d": 816,
      "a5": 817,
      "HY": 818,
      "cd": 819,
      "24": 820,
      "a9": 821,
      "OG": 822,
      "IC": 823,
      "6d": 824,
      "he": 825,
      "2f": 826,
      "3b": 827,
      "3d": 828,
      "ap": 829,
      "2d": 830,
      "456": 831,
      "ts": 832,
      "OW": 833,
      "▁VARCHAR(15),\n": 834,
      "ov": 835,
      "ik": 836,
      "ud": 837,
      "3,": 838,
      ".com": 839,
      "▁'2022-01-01": 840,
      "ib": 841,
      "▁100": 842,
      "9d": 843,
      "ub": 844,
      "oy": 845,
      "ample": 846,
      "Sm": 847,
      "9f": 848,
      "27": 849,
      "cb": 850,
      "un": 851,
      "eb": 852,
      "1f": 853,
      "tr": 854,
      "Im": 855,
      "97": 856,
      "c7": 857,
      "ps": 858,
      "3f": 859,
      "ly": 860,
      "Ad": 861,
      "Fr": 862,
      "c0": 863,
      "ok": 864,
      "wn": 865,
      "37": 866,
      "XY": 867,
      "95": 868,
      "gr": 869,
      "c4": 870,
      "cf": 871,
      "35": 872,
      "94": 873,
      "c5": 874,
      "iq": 875,
      "pr": 876,
      "se": 877,
      "FT": 878,
      "28": 879,
      "US": 880,
      "az": 881,
      "UR": 882,
      "ix": 883,
      "Ex": 884,
      "e5": 885,
      "e7": 886,
      "▁'J": 887,
      "of": 888,
      "AX": 889,
      "▁JOIN": 890,
      "ah": 891,
      "ip": 892,
      "aw": 893,
      "ax": 894,
      "ey": 895,
      "CK": 896,
      "cl": 897,
      "Dr": 898,
      "IP": 899,
      "Bv": 900,
      "Bl": 901,
      "Bq": 902,
      "JK": 903,
      "Br": 904,
      "aj": 905,
      "BY": 906,
      "aZ": 907,
      "up": 908,
      "ij": 909,
      "88": 910,
      "FK": 911,
      "QL": 912,
      "Ij": 913,
      "FZ": 914,
      "Hy": 915,
      "aq": 916,
      "iG": 917,
      "Jb": 918,
      "aK": 919,
      "ww": 920,
      "By": 921,
      "ox": 922,
      "aG": 923,
      "iY": 924,
      "Jz": 925,
      "Bm": 926,
      "Fl": 927,
      "JY": 928,
      "Fv": 929,
      "FG": 930,
      "IZ": 931,
      "ep": 932,
      "Iz": 933,
      "Bj": 934,
      "Bz": 935,
      "BK": 936,
      "Iy": 937,
      "Ib": 938,
      "Fq": 939,
      "JG": 940,
      "JZ": 941,
      "aY": 942,
      "Jm": 943,
      "Fb": 944,
      "Fk": 945,
      "Xv": 946,
      "ux": 947,
      "Fz": 948,
      "BZ": 949,
      "Bx": 950,
      "Jj": 951,
      "Bk": 952,
      "iZ": 953,
      "Jv": 954,
      "Pr": 955,
      "Fm": 956,
      "iK": 957,
      "Jq": 958,
      "Jx": 959,
      "Fy": 960,
      "oZ": 961,
      "e0": 962,
      "AY": 963,
      "Wv": 964,
      "e4": 965,
      "Ik": 966,
      "Jy": 967,
      "HK": 968,
      "Jk": 969,
      "iy": 970,
      "a6": 971,
      "ug": 972,
      "i0": 973,
      "▁(2,": 974,
      "example": 975,
      "IY": 976,
      "BG": 977,
      "Fj": 978,
      "Wm": 979,
      "FY": 980,
      "Iv": 981,
      "Ix": 982,
      "iV": 983,
      "Cl": 984,
      "Hq": 985,
      "oz": 986,
      "Jg": 987,
      "Fx": 988,
      "QK": 989,
      "JV": 990,
      "Bb": 991,
      "Un": 992,
      "Sh": 993,
      "Iq": 994,
      "oj": 995,
      "Wq": 996,
      "oG": 997,
      "Xq": 998,
      "Xy": 999,
      "Qm": 1000,
      "Us": 1001,
      "WG": 1002,
      "QY": 1003,
      "Xk": 1004,
      "QG": 1005,
      "Wk": 1006,
      "FV": 1007,
      "Qy": 1008,
      "Fg": 1009,
      "Bf": 1010,
      "WZ": 1011,
      "uy": 1012,
      "WK": 1013,
      "HZ": 1014,
      "Em": 1015,
      "Ff": 1016,
      "If": 1017,
      "Am": 1018,
      "Hv": 1019,
      "XK": 1020,
      "Hk": 1021,
      "QZ": 1022,
      "Av": 1023,
      "Wb": 1024,
      "Ph": 1025,
      "Wy": 1026,
      "Jf": 1027,
      "oq": 1028,
      "Bg": 1029,
      "Xx": 1030,
      "Qx": 1031,
      "Hz": 1032,
      "F0": 1033,
      "Qq": 1034,
      "Wh": 1035,
      "Ig": 1036,
      "Xb": 1037,
      "CG": 1038,
      "Pl": 1039,
      "aV": 1040,
      "My": 1041,
      "UG": 1042,
      "oY": 1043,
      "Qk": 1044,
      "XG": 1045,
      "Wx": 1046,
      "2j": 1047,
      "BV": 1048,
      "B7": 1049,
      "XZ": 1050,
      "It": 1051,
      "Qj": 1052,
      "Hj": 1053,
      "WY": 1054,
      "IV": 1055,
      "Qz": 1056,
      "i7": 1057,
      "HG": 1058,
      "2m": 1059,
      "Bd": 1060,
      "='": 1061,
      "Mq": 1062,
      "uv": 1063,
      "uq": 1064,
      "Qv": 1065,
      "oV": 1066,
      "uf": 1067,
      "Ir": 1068,
      "Wj": 1069,
      "cy": 1070,
      "2k": 1071,
      "Xm": 1072,
      "Xz": 1073,
      "uY": 1074,
      "HV": 1075,
      "Hb": 1076,
      "UY": 1077,
      "Mb": 1078,
      "Sy": 1079,
      "Hx": 1080,
      "Uz": 1081,
      "Xj": 1082,
      "Qb": 1083,
      "Uv": 1084,
      "2K": 1085,
      "Hm": 1086,
      "Xf": 1087,
      "F4": 1088,
      "Fd": 1089,
      "Fh": 1090,
      "Qg": 1091,
      "uZ": 1092,
      "Wf": 1093,
      "Wg": 1094,
      "Jh": 1095,
      "iw": 1096,
      "oK": 1097,
      "Is": 1098,
      "Wr": 1099,
      "2x": 1100,
      "MY": 1101,
      "WV": 1102,
      "F7": 1103,
      "Mk": 1104,
      "Wz": 1105,
      "As": 1106,
      "QV": 1107,
      "Mj": 1108,
      "Ih": 1109,
      "Uj": 1110,
      "J0": 1111,
      "Uk": 1112,
      "Jw": 1113,
      "Ub": 1114,
      "2z": 1115,
      "Cr": 1116,
      "uG": 1117,
      "Fw": 1118,
      "eh": 1119,
      "uj": 1120,
      "Ux": 1121,
      "2v": 1122,
      "MG": 1123,
      "XV": 1124,
      "Uy": 1125,
      "Iw": 1126,
      "F5": 1127,
      "2Z": 1128,
      "MK": 1129,
      "▁<": 1130,
      "UK": 1131,
      "B0": 1132,
      "2q": 1133,
      "I0": 1134,
      "UZ": 1135,
      "aL": 1136,
      "Mm": 1137,
      "Um": 1138,
      "Xh": 1139,
      "Id": 1140,
      "Mx": 1141,
      "I5": 1142,
      "uk": 1143,
      "ih": 1144,
      "26": 1145,
      "Xg": 1146,
      "8Y": 1147,
      "8z": 1148,
      "IL": 1149,
      "uK": 1150,
      "Mz": 1151,
      "Ab": 1152,
      "8K": 1153,
      "iL": 1154,
      "RY": 1155,
      "Jd": 1156,
      "AG": 1157,
      "I7": 1158,
      "MZ": 1159,
      "Hg": 1160,
      "2y": 1161,
      "o7": 1162,
      "FL": 1163,
      "8q": 1164,
      "Bw": 1165,
      "Jl": 1166,
      "Bs": 1167,
      "2G": 1168,
      "29": 1169,
      "Bh": 1170,
      "An": 1171,
      "Qr": 1172,
      "JL": 1173,
      "FD": 1174,
      "uz": 1175,
      "NG": 1176,
      "i5": 1177,
      "▁FLOAT\n);\n\nCREATE": 1178,
      "Sk": 1179,
      "pg": 1180,
      "PG": 1181,
      "Xl": 1182,
      "o0": 1183,
      "ph": 1184,
      "Fs": 1185,
      "J7": 1186,
      "Js": 1187,
      "Ob": 1188,
      "Aj": 1189,
      "Uq": 1190,
      "B4": 1191,
      "Jr": 1192,
      "Th": 1193,
      "i4": 1194,
      "J4": 1195,
      "Hf": 1196,
      "Ww": 1197,
      "Bt": 1198,
      "Or": 1199,
      "B5": 1200,
      "SG": 1201,
      "1k": 1202,
      "Fn": 1203,
      "Qf": 1204,
      "UV": 1205,
      "Jt": 1206,
      "8h": 1207,
      "Cm": 1208,
      "Mg": 1209,
      "BD": 1210,
      "8G": 1211,
      "Ur": 1212,
      "2Y": 1213,
      "Q7": 1214,
      "Ar": 1215,
      "2V": 1216,
      "Aq": 1217,
      "Mv": 1218,
      "Mf": 1219,
      "8m": 1220,
      "oL": 1221,
      "NY": 1222,
      "8y": 1223,
      "uV": 1224,
      "Oz": 1225,
      "Az": 1226,
      "Sb": 1227,
      "86": 1228,
      "Uf": 1229,
      "Ug": 1230,
      "Xr": 1231,
      "Il": 1232,
      "OZ": 1233,
      "Ak": 1234,
      "Qh": 1235,
      "SY": 1236,
      "Qd": 1237,
      "JD": 1238,
      "Bn": 1239,
      "Py": 1240,
      "OY": 1241,
      "Hr": 1242,
      "8x": 1243,
      "Ql": 1244,
      "Cy": 1245,
      "Q0": 1246,
      "Ay": 1247,
      "2l": 1248,
      "Ax": 1249,
      "Xs": 1250,
      "BL": 1251,
      "Hd": 1252,
      "Md": 1253,
      "Sq": 1254,
      "1x": 1255,
      "H0": 1256,
      "WL": 1257,
      "Xw": 1258,
      "J5": 1259,
      "Pk": 1260,
      "8v": 1261,
      "Ag": 1262,
      "o5": 1263,
      "8Z": 1264,
      "HL": 1265,
      "X7": 1266,
      "Q5": 1267,
      "X0": 1268,
      "3m": 1269,
      "example.com": 1270,
      "PK": 1271,
      "Ul": 1272,
      "Ov": 1273,
      "1m": 1274,
      "Oq": 1275,
      "Xd": 1276,
      "W5": 1277,
      "Hw": 1278,
      "MV": 1279,
      "Q4": 1280,
      "XL": 1281,
      "W7": 1282,
      "Ox": 1283,
      "8k": 1284,
      "iD": 1285,
      "Hh": 1286,
      "SZ": 1287,
      "Xt": 1288,
      "Oy": 1289,
      "Oj": 1290,
      "u7": 1291,
      "I4": 1292,
      "W0": 1293,
      "3y": 1294,
      "Wl": 1295,
      "AZ": 1296,
      "Qw": 1297,
      "8j": 1298,
      "2g": 1299,
      "OV": 1300,
      "Cj": 1301,
      "Wd": 1302,
      "Sv": 1303,
      "Uw": 1304,
      "aD": 1305,
      "Hl": 1306,
      "2L": 1307,
      "3j": 1308,
      "Ud": 1309,
      "Pq": 1310,
      "1z": 1311,
      "W4": 1312,
      "Jn": 1313,
      "AK": 1314,
      "Sz": 1315,
      "Rz": 1316,
      "Sj": 1317,
      "1q": 1318,
      "Pj": 1319,
      "Sx": 1320,
      "Pz": 1321,
      "Mr": 1322,
      "Af": 1323,
      "Rm": 1324,
      "Nx": 1325,
      "3k": 1326,
      "H4": 1327,
      "Ok": 1328,
      "Rq": 1329,
      "8V": 1330,
      "SK": 1331,
      "Wn": 1332,
      "Xn": 1333,
      "1y": 1334,
      "RK": 1335,
      "2w": 1336,
      "Ws": 1337,
      "3Z": 1338,
      "1Y": 1339,
      "OK": 1340,
      "Ut": 1341,
      "cx": 1342,
      "H5": 1343,
      "WD": 1344,
      "H7": 1345,
      "uh": 1346,
      "Px": 1347,
      "2h": 1348,
      "Qn": 1349,
      "Rx": 1350,
      "U7": 1351,
      "2s": 1352,
      "OL": 1353,
      "3z": 1354,
      "1j": 1355,
      "Rk": 1356,
      "8g": 1357,
      "Cb": 1358,
      "Ck": 1359,
      "1Z": 1360,
      "A0": 1361,
      "oD": 1362,
      "3Y": 1363,
      "RG": 1364,
      "3v": 1365,
      "XD": 1366,
      "3G": 1367,
      "Wt": 1368,
      "Nz": 1369,
      "Of": 1370,
      "Om": 1371,
      "M0": 1372,
      "Cv": 1373,
      "CV": 1374,
      "Sf": 1375,
      "PZ": 1376,
      "Ft": 1377,
      "ck": 1378,
      "Og": 1379,
      "Mw": 1380,
      "3q": 1381,
      "X4": 1382,
      "Ry": 1383,
      "Rv": 1384,
      "Pb": 1385,
      "Pv": 1386,
      "CZ": 1387,
      "1K": 1388,
      "PY": 1389,
      "Uh": 1390,
      "Sg": 1391,
      "u0": 1392,
      "1v": 1393,
      "Nk": 1394,
      "Mh": 1395,
      "AD": 1396,
      "9G": 1397,
      "SV": 1398,
      "NK": 1399,
      "Ny": 1400,
      "U4": 1401,
      "Nm": 1402,
      "3K": 1403,
      "Ht": 1404,
      "8r": 1405,
      "Cq": 1406,
      "M7": 1407,
      "On": 1408,
      "Hs": 1409,
      "Nj": 1410,
      "6Z": 1411,
      "Qt": 1412,
      "Hn": 1413,
      "9z": 1414,
      "Nq": 1415,
      "Cx": 1416,
      "Rb": 1417,
      "uL": 1418,
      "o4": 1419,
      "uw": 1420,
      "Pf": 1421,
      "Nb": 1422,
      "2r": 1423,
      "6Y": 1424,
      "Sw": 1425,
      "Nf": 1426,
      "aT": 1427,
      "6K": 1428,
      "RZ": 1429,
      "Qs": 1430,
      "Rj": 1431,
      "cY": 1432,
      "NZ": 1433,
      "1G": 1434,
      "Nv": 1435,
      "1g": 1436,
      "Pm": 1437,
      "Ml": 1438,
      "BT": 1439,
      "u5": 1440,
      "SL": 1441,
      "3x": 1442,
      "PV": 1443,
      "8L": 1444,
      "QD": 1445,
      "cG": 1446,
      "ML": 1447,
      "iT": 1448,
      "9v": 1449,
      "9j": 1450,
      "6m": 1451,
      "CY": 1452,
      "Aw": 1453,
      "cv": 1454,
      "X5": 1455,
      "U5": 1456,
      "cz": 1457,
      "U0": 1458,
      "Rg": 1459,
      "9k": 1460,
      "3V": 1461,
      "6j": 1462,
      "3g": 1463,
      "9Z": 1464,
      "9Y": 1465,
      "Ng": 1466,
      "9y": 1467,
      "9q": 1468,
      "A5": 1469,
      "HD": 1470,
      "uD": 1471,
      "1V": 1472,
      "Cz": 1473,
      "8t": 1474,
      "S0": 1475,
      "A7": 1476,
      "M5": 1477,
      "6q": 1478,
      "6x": 1479,
      "2n": 1480,
      "M4": 1481,
      "9K": 1482,
      "Ah": 1483,
      "Mn": 1484,
      "NV": 1485,
      "2D": 1486,
      "8l": 1487,
      "Od": 1488,
      "JT": 1489,
      "6G": 1490,
      "Ms": 1491,
      "A4": 1492,
      "UD": 1493,
      "Mt": 1494,
      "6y": 1495,
      "8s": 1496,
      "Ol": 1497,
      "Cd": 1498,
      "Sn": 1499,
      "cK": 1500,
      "1l": 1501,
      "pm": 1502,
      "At": 1503,
      "Ow": 1504,
      "6z": 1505,
      "cj": 1506,
      "S7": 1507,
      "UT": 1508,
      "Ev": 1509,
      "6k": 1510,
      "Sd": 1511,
      "Cf": 1512,
      "8w": 1513,
      "▁TIMESTAMP\n);": 1514,
      "cZ": 1515,
      "Oh": 1516,
      "C7": 1517,
      "pk": 1518,
      "cq": 1519,
      "Rl": 1520,
      "cm": 1521,
      "py": 1522,
      "8n": 1523,
      "O0": 1524,
      "Rf": 1525,
      "O7": 1526,
      "Sl": 1527,
      "P7": 1528,
      "1h": 1529,
      "6g": 1530,
      "u4": 1531,
      "cV": 1532,
      "MD": 1533,
      "9x": 1534,
      "pZ": 1535,
      "Nr": 1536,
      "3r": 1537,
      "SD": 1538,
      "000": 1539,
      "cg": 1540,
      "Pg": 1541,
      "ek": 1542,
      "3h": 1543,
      "Sr": 1544,
      "P0": 1545,
      "pY": 1546,
      "Cg": 1547,
      "3w": 1548,
      "C0": 1549,
      "N0": 1550,
      "6v": 1551,
      "Rw": 1552,
      "2t": 1553,
      "Pd": 1554,
      "S4": 1555,
      "8D": 1556,
      "px": 1557,
      "HT": 1558,
      "Nw": 1559,
      "CL": 1560,
      "pj": 1561,
      "Os": 1562,
      "RL": 1563,
      "9g": 1564,
      "9L": 1565,
      "P5": 1566,
      "Pn": 1567,
      "pq": 1568,
      "Pw": 1569,
      "pV": 1570,
      "O4": 1571,
      "S5": 1572,
      "9h": 1573,
      "9m": 1574,
      "eq": 1575,
      "pK": 1576,
      "Rd": 1577,
      "3s": 1578,
      "R0": 1579,
      "Rt": 1580,
      "C5": 1581,
      "NL": 1582,
      "Nd": 1583,
      "oT": 1584,
      "1r": 1585,
      "3n": 1586,
      "OD": 1587,
      "1w": 1588,
      "R7": 1589,
      "pz": 1590,
      "uT": 1591,
      "pv": 1592,
      "N7": 1593,
      "9r": 1594,
      "QT": 1595,
      "Ss": 1596,
      "9V": 1597,
      "Rr": 1598,
      "Cw": 1599,
      "PL": 1600,
      "WT": 1601,
      "6V": 1602,
      "6w": 1603,
      "3l": 1604,
      "Nh": 1605,
      "Nn": 1606,
      "pb": 1607,
      "pw": 1608,
      "Ot": 1609,
      "1t": 1610,
      "pf": 1611,
      "1s": 1612,
      "1L": 1613,
      "Nl": 1614,
      "Rh": 1615,
      "O5": 1616,
      "1n": 1617,
      "2T": 1618,
      "ST": 1619,
      ":00',": 1620,
      "9l": 1621,
      "Ps": 1622,
      "1D": 1623,
      "pG": 1624,
      "N5": 1625,
      "3L": 1626,
      "C4": 1627,
      "Nt": 1628,
      "6l": 1629,
      "Cs": 1630,
      "cL": 1631,
      "Rs": 1632,
      "Ns": 1633,
      "MT": 1634,
      "3D": 1635,
      "6h": 1636,
      "Pt": 1637,
      "Cn": 1638,
      "6n": 1639,
      "▁ASC": 1640,
      "CD": 1641,
      "9w": 1642,
      "e',": 1643,
      "3t": 1644,
      "P4": 1645,
      "6D": 1646,
      "R5": 1647,
      "R4": 1648,
      ".00": 1649,
      "eG": 1650,
      "FE": 1651,
      "BE": 1652,
      "cw": 1653,
      "6L": 1654,
      "cn": 1655,
      "Ct": 1656,
      "Rn": 1657,
      "8T": 1658,
      "N4": 1659,
      "6s": 1660,
      "iE": 1661,
      "9s": 1662,
      "aE": 1663,
      "eY": 1664,
      "6r": 1665,
      "6t": 1666,
      "eV": 1667,
      "9n": 1668,
      "p7": 1669,
      "IE": 1670,
      "p0": 1671,
      "ej": 1672,
      "ez": 1673,
      "eZ": 1674,
      "9t": 1675,
      "cD": 1676,
      "p4": 1677,
      "JE": 1678,
      "cs": 1679,
      "eK": 1680,
      "pL": 1681,
      "3T": 1682,
      "9D": 1683,
      "▁DECIMAL\n);\n\nCREATE": 1684,
      "1T": 1685,
      "p5": 1686,
      "PT": 1687,
      "RT": 1688,
      "▁DECIMAL(5,": 1689,
      "XE": 1690,
      "pD": 1691,
      "HE": 1692,
      "QE": 1693,
      "pn": 1694,
      "eL": 1695,
      "-a": 1696,
      "oE": 1697,
      "2E": 1698,
      "9T": 1699,
      "uE": 1700,
      "@example.com": 1701,
      "6T": 1702,
      "cT": 1703,
      "8E": 1704,
      "eD": 1705,
      "ent": 1706,
      "AE": 1707,
      "pT": 1708,
      "3E": 1709,
      "CE": 1710,
      "PE": 1711,
      "NE": 1712,
      "▁UNIQUE,\n": 1713,
      "1E": 1714,
      "OE": 1715,
      "4567": 1716,
      "▁VARCHAR(20)": 1717,
      "eT": 1718,
      "6E": 1719,
      "cE": 1720,
      "9E": 1721,
      "▁VARCHAR\n);\n\nCREATE": 1722,
      "ith": 1723,
      "pE": 1724,
      "▁TIME,\n": 1725,
      "▁'M": 1726,
      "8,": 1727,
      "-e": 1728,
      "eE": 1729,
      "▁'P": 1730,
      "▁JSONB": 1731,
      "▁'12": 1732,
      "▁'S": 1733,
      "▁'John": 1734,
      "▁'C": 1735,
      "bb": 1736,
      "▁AS": 1737,
      "▁Doe": 1738,
      "0,": 1739,
      "2),\n": 1740,
      "b7": 1741,
      "-42": 1742,
      "89b": 1743,
      "bf": 1744,
      "d4": 1745,
      "▁BYTE": 1746,
      "b5": 1747,
      "b4": 1748,
      "b0": 1749,
      "-4266": 1750,
      "▁FO": 1751,
      "-12d3": 1752,
      "-a456": 1753,
      "lm": 1754,
      "-a456-4266": 1755,
      "74": 1756,
      "io": 1757,
      "-12d3-a456-4266": 1758,
      "-e89b": 1759,
      "d5": 1760,
      ":30": 1761,
      "-e89b-12d3-a456-4266": 1762,
      "df": 1763,
      "sf": 1764,
      "174": 1765,
      "2c": 1766,
      "nv": 1767,
      "7f": 1768,
      "sh": 1769,
      "▁VARCHAR(100)\n);": 1770,
      "d0": 1771,
      "▁BYTEA": 1772,
      "ry": 1773,
      "70": 1774,
      "ty": 1775,
      "ia": 1776,
      "ds": 1777,
      "ULT": 1778,
      "▁'N": 1779,
      "4567-e89b-12d3-a456-4266": 1780,
      "ns": 1781,
      "gm": 1782,
      "40": 1783,
      "Tr": 1784,
      "pe": 1785,
      "tm": 1786,
      "14174": 1787,
      "gy": 1788,
      "4f": 1789,
      "IGN": 1790,
      "ks": 1791,
      "▁0.": 1792,
      "Ty": 1793,
      "FAULT": 1794,
      "ll": 1795,
      "nf": 1796,
      "▁FORE": 1797,
      "d7": 1798,
      "dr": 1799,
      "▁FOREIGN": 1800,
      "ny": 1801,
      "▁DEFAULT": 1802,
      "2e": 1803,
      "KY": 1804,
      "▁'2021": 1805,
      "kz": 1806,
      "kx": 1807,
      "8c": 1808,
      "Vx": 1809,
      "Km": 1810,
      "ky": 1811,
      "jq": 1812,
      "Dm": 1813,
      "8e": 1814,
      "nm": 1815,
      "ss": 1816,
      "KZ": 1817,
      "Dx": 1818,
      "jG": 1819,
      "km": 1820,
      "jy": 1821,
      "Lq": 1822,
      "0x": 1823,
      "▁'j": 1824,
      "Kz": 1825,
      "Dz": 1826,
      "VY": 1827,
      "He": 1828,
      "Kx": 1829,
      "Vm": 1830,
      "1e": 1831,
      "dv": 1832,
      "Kq": 1833,
      "by": 1834,
      "kG": 1835,
      "ae": 1836,
      "36": 1837,
      "jz": 1838,
      "jm": 1839,
      "9,": 1840,
      "Lv": 1841,
      "DG": 1842,
      "Ky": 1843,
      "KG": 1844,
      "Vv": 1845,
      "▁FLOAT\n);": 1846,
      "DZ": 1847,
      "kY": 1848,
      "kq": 1849,
      "DY": 1850,
      "Dv": 1851,
      "05": 1852,
      "Vz": 1853,
      "dm": 1854,
      "kZ": 1855,
      "dy": 1856,
      "4,": 1857,
      "Vy": 1858,
      "wq": 1859,
      "VZ": 1860,
      "Lx": 1861,
      "Kf": 1862,
      "Vq": 1863,
      "LG": 1864,
      "96": 1865,
      "kv": 1866,
      "bx": 1867,
      "Lz": 1868,
      "jY": 1869,
      "jZ": 1870,
      "Ly": 1871,
      "Dy": 1872,
      "3c": 1873,
      "kf": 1874,
      "jx": 1875,
      "LZ": 1876,
      "lZ": 1877,
      "Lm": 1878,
      "bG": 1879,
      "ie": 1880,
      "bv": 1881,
      "1c": 1882,
      "OI": 1883,
      "Kv": 1884,
      "gh": 1885,
      "bq": 1886,
      "Lf": 1887,
      "lY": 1888,
      "LY": 1889,
      "lG": 1890,
      "Vh": 1891,
      "bZ": 1892,
      "Dq": 1893,
      "nq": 1894,
      "gY": 1895,
      "lv": 1896,
      "4567-e89b-12d3-a456-426614174": 1897,
      "wm": 1898,
      "gv": 1899,
      "wZ": 1900,
      "Df": 1901,
      "lq": 1902,
      "nZ": 1903,
      "wz": 1904,
      "wv": 1905,
      "gx": 1906,
      "jf": 1907,
      "lx": 1908,
      "jv": 1909,
      "nx": 1910,
      "1a": 1911,
      "gG": 1912,
      "nY": 1913,
      "nz": 1914,
      "wy": 1915,
      "Vf": 1916,
      "Tv": 1917,
      "▁2)\n);\n\nCREATE": 1918,
      "dq": 1919,
      "wx": 1920,
      "dZ": 1921,
      "bm": 1922,
      "Dh": 1923,
      "bz": 1924,
      "kh": 1925,
      "Tx": 1926,
      "Qu": 1927,
      "Vr": 1928,
      "V5": 1929,
      "dY": 1930,
      "gz": 1931,
      "TY": 1932,
      "jh": 1933,
      "dz": 1934,
      "br": 1935,
      "wf": 1936,
      "lz": 1937,
      "9e": 1938,
      "bY": 1939,
      "Kr": 1940,
      "Tq": 1941,
      "▁ASC;": 1942,
      "nh": 1943,
      "9c": 1944,
      "Tz": 1945,
      "k5": 1946,
      "wr": 1947,
      "D5": 1948,
      "nG": 1949,
      "K5": 1950,
      "gq": 1951,
      "dx": 1952,
      "Tf": 1953,
      "wY": 1954,
      "gf": 1955,
      "Kh": 1956,
      "gZ": 1957,
      "▁fk_": 1958,
      "j5": 1959,
      "wG": 1960,
      "Tm": 1961,
      "7q": 1962,
      "Lh": 1963,
      "FF": 1964,
      "Lr": 1965,
      "TG": 1966,
      "bh": 1967,
      "jr": 1968,
      "lf": 1969,
      "L5": 1970,
      "7m": 1971,
      "wh": 1972,
      "kr": 1973,
      "ls": 1974,
      "7y": 1975,
      "ation": 1976,
      "dh": 1977,
      "7v": 1978,
      "D0": 1979,
      "JJ": 1980,
      "WH": 1981,
      "BX": 1982,
      "7z": 1983,
      "7Y": 1984,
      "7x": 1985,
      "BP": 1986,
      "lh": 1987,
      "l5": 1988,
      "7Z": 1989,
      "tx": 1990,
      "lr": 1991,
      "w5": 1992,
      "7G": 1993,
      "n5": 1994,
      "dG": 1995,
      "iX": 1996,
      "K0": 1997,
      "4y": 1998,
      "7h": 1999,
      "4G": 2000,
      "FP": 2001,
      "4x": 2002,
      "13": 2003,
      "4Y": 2004,
      "tG": 2005,
      "j0": 2006,
      "V0": 2007,
      "4m": 2008,
      "WP": 2009,
      "4q": 2010,
      "WX": 2011,
      "QX": 2012,
      "4v": 2013,
      "ice": 2014,
      "Be": 2015,
      "B6": 2016,
      "tY": 2017,
      "i6": 2018,
      "tZ": 2019,
      "T5": 2020,
      "nr": 2021,
      "L0": 2022,
      "WJ": 2023,
      "8a": 2024,
      "Op": 2025,
      "k0": 2026,
      "QJ": 2027,
      "w0": 2028,
      "tf": 2029,
      "Vs": 2030,
      "g5": 2031,
      "IX": 2032,
      "2a": 2033,
      "4Z": 2034,
      "tz": 2035,
      "js": 2036,
      "BS": 2037,
      "(\n": 2038,
      "iM": 2039,
      "iP": 2040,
      "4z": 2041,
      "-20": 2042,
      "bs": 2043,
      "Eq": 2044,
      "BN": 2045,
      "iH": 2046,
      "g0": 2047,
      "EG": 2048,
      "Ey": 2049,
      "BH": 2050,
      "2P": 2051,
      "BJ": 2052,
      "QH": 2053,
      "BM": 2054,
      "tq": 2055,
      "QP": 2056,
      "UX": 2057,
      "oX": 2058,
      "83": 2059,
      "oP": 2060,
      "iJ": 2061,
      "iC": 2062,
      "Bu": 2063,
      "iN": 2064,
      "2X": 2065,
      "F6": 2066,
      "n0": 2067,
      "l0": 2068,
      "We": 2069,
      "WS": 2070,
      "IH": 2071,
      "IJ": 2072,
      "Ez": 2073,
      "c6": 2074,
      "FC": 2075,
      "W6": 2076,
      "Ds": 2077,
      "OP": 2078,
      "tv": 2079,
      "8P": 2080,
      "2H": 2081,
      "EZ": 2082,
      "iS": 2083,
      "Q6": 2084,
      "QM": 2085,
      "QC": 2086,
      "Re": 2087,
      "FH": 2088,
      "4h": 2089,
      "gs": 2090,
      "o6": 2091,
      "Wp": 2092,
      "FX": 2093,
      "Ks": 2094,
      "WN": 2095,
      "T0": 2096,
      "FM": 2097,
      "-15',": 2098,
      "Ls": 2099,
      "FJ": 2100,
      "Fe": 2101,
      "2N": 2102,
      "I6": 2103,
      "oJ": 2104,
      "▁(10": 2105,
      "WM": 2106,
      "FS": 2107,
      "Ip": 2108,
      "8X": 2109,
      "Qp": 2110,
      "QS": 2111,
      "oH": 2112,
      "Ef": 2113,
      "Fu": 2114,
      "FN": 2115,
      "7r": 2116,
      "Fa": 2117,
      "AC": 2118,
      "AM": 2119,
      "Bp": 2120,
      "iu": 2121,
      "9a": 2122,
      "ws": 2123,
      "OS": 2124,
      "2J": 2125,
      "Eh": 2126,
      "BR": 2127,
      "UH": 2128,
      "1H": 2129,
      "2S": 2130,
      "1P": 2131,
      "oC": 2132,
      "Er": 2133,
      "1X": 2134,
      "▁UUID\n);\n\nCREATE": 2135,
      "8M": 2136,
      "UC": 2137,
      "UJ": 2138,
      "A6": 2139,
      "8C": 2140,
      "QN": 2141,
      "Up": 2142,
      "AS": 2143,
      "t5": 2144,
      "WC": 2145,
      "4r": 2146,
      "2M": 2147,
      "oS": 2148,
      "Iu": 2149,
      "Ts": 2150,
      "8H": 2151,
      "▁DECIMAL\n);": 2152,
      "AH": 2153,
      "oN": 2154,
      "Wu": 2155,
      "Ie": 2156,
      "UN": 2157,
      "U6": 2158,
      "OJ": 2159,
      "E5": 2160,
      "Fp": 2161,
      "8J": 2162,
      "OH": 2163,
      "3P": 2164,
      "AJ": 2165,
      "2C": 2166,
      "OX": 2167,
      "2p": 2168,
      "Bc": 2169,
      "oM": 2170,
      "39": 2171,
      "@example.com',": 2172,
      "8N": 2173,
      "Ap": 2174,
      "Qe": 2175,
      "QR": 2176,
      "Fc": 2177,
      "2u": 2178,
      "8p": 2179,
      "OM": 2180,
      "O6": 2181,
      "WR": 2182,
      "Ic": 2183,
      "IR": 2184,
      "1C": 2185,
      "Ou": 2186,
      "7s": 2187,
      "1N": 2188,
      "Wc": 2189,
      "1J": 2190,
      "iR": 2191,
      "3a": 2192,
      "8S": 2193,
      "Ac": 2194,
      "t0": 2195,
      "Uc": 2196,
      "Qc": 2197,
      "2R": 2198,
      "9X": 2199,
      "Uu": 2200,
      "9P": 2201,
      "FR": 2202,
      "3J": 2203,
      "Au": 2204,
      "Ue": 2205,
      "4s": 2206,
      "E0": 2207,
      "OC": 2208,
      "oR": 2209,
      "1M": 2210,
      "Oe": 2211,
      "9H": 2212,
      "9J": 2213,
      "3X": 2214,
      "▁JSONB,\n": 2215,
      "1S": 2216,
      "8u": 2217,
      "1p": 2218,
      "Oc": 2219,
      "Ae": 2220,
      "▁20": 2221,
      "Ba": 2222,
      "3C": 2223,
      "3M": 2224,
      "1u": 2225,
      "1R": 2226,
      "OR": 2227,
      "3N": 2228,
      "Es": 2229,
      "3H": 2230,
      "9S": 2231,
      "9p": 2232,
      "8R": 2233,
      "aP": 2234,
      "▁'A": 2235,
      "9N": 2236,
      "aX": 2237,
      "3S": 2238,
      "9C": 2239,
      "aN": 2240,
      "9M": 2241,
      "bd": 2242,
      "au": 2243,
      "▁'D": 2244,
      "3u": 2245,
      "aJ": 2246,
      "aH": 2247,
      "9u": 2248,
      "▁Sm": 2249,
      "3p": 2250,
      "▁Doe',": 2251,
      "1;": 2252,
      "i,": 2253,
      "aC": 2254,
      "lg": 2255,
      "3R": 2256,
      "ys": 2257,
      "aS": 2258,
      "doe": 2259,
      "ale": 2260,
      "aM": 2261,
      "o,": 2262,
      "B,": 2263,
      "9R": 2264,
      "f5": 2265,
      "nj": 2266,
      "db": 2267,
      "kg": 2268,
      "Lt": 2269,
      "I,": 2270,
      "F,": 2271,
      "KV": 2272,
      "7b": 2273,
      "kt": 2274,
      "kV": 2275,
      "Q,": 2276,
      "kj": 2277,
      "Lj": 2278,
      "DV": 2279,
      "Lg": 2280,
      "Kg": 2281,
      "U,": 2282,
      "6e": 2283,
      "yz": 2284,
      "IKE": 2285,
      "LV": 2286,
      "YZ": 2287,
      "W,": 2288,
      "al_": 2289,
      "Kt": 2290,
      "3e4567-e89b-12d3-a456-426614174": 2291,
      "Dj": 2292,
      "▁'2023": 2293,
      "lV": 2294,
      "_m": 2295,
      "Dt": 2296,
      "Kj": 2297,
      "▁2,": 2298,
      "aR": 2299,
      "_x": 2300,
      "wg": 2301,
      "f0": 2302,
      "47": 2303,
      "nV": 2304,
      "▁1000": 2305,
      "A,": 2306,
      "lt": 2307,
      "Dg": 2308,
      "wV": 2309,
      "dd": 2310,
      "wt": 2311,
      "vz": 2312,
      "O,": 2313,
      ":00:00": 2314,
      "wj": 2315,
      "_Z": 2316,
      "YG": 2317,
      "vx": 2318,
      "qG": 2319,
      "_G": 2320,
      "_z": 2321,
      "qz": 2322,
      "▁_m": 2323,
      "lj": 2324,
      "▁_Z": 2325,
      "qm": 2326,
      "TV": 2327,
      "qx": 2328,
      "ym": 2329,
      "7g": 2330,
      "vm": 2331,
      "qZ": 2332,
      "6c": 2333,
      "vZ": 2334,
      "▁_G": 2335,
      "ld": 2336,
      "▁_x": 2337,
      "vG": 2338,
      "bt": 2339,
      "▁_z": 2340,
      "rr": 2341,
      "_5": 2342,
      "Tt": 2343,
      "bV": 2344,
      "iQ": 2345,
      "Tj": 2346,
      "Yz": 2347,
      "▁LIKE": 2348,
      "BQ": 2349,
      "Tg": 2350,
      "bj": 2351,
      "D4": 2352,
      "_h": 2353,
      "KK": 2354,
      "bg": 2355,
      "7d": 2356,
      "Yx": 2357,
      "yG": 2358,
      "k4": 2359,
      "TS": 2360,
      "sG": 2361,
      "XX": 2362,
      "qf": 2363,
      "Yh": 2364,
      "yZ": 2365,
      "_f": 2366,
      "yx": 2367,
      "2Q": 2368,
      "Ym": 2369,
      "▁_h": 2370,
      "Fi": 2371,
      "rx": 2372,
      "L4": 2373,
      "oQ": 2374,
      "vh": 2375,
      "IW": 2376,
      "7V": 2377,
      "qh": 2378,
      "MS": 2379,
      "rZ": 2380,
      "kK": 2381,
      "7t": 2382,
      "98": 2383,
      "BB": 2384,
      "sx": 2385,
      "q5": 2386,
      "6,": 2387,
      "▁_5": 2388,
      "7j": 2389,
      "rz": 2390,
      "FW": 2391,
      "2W": 2392,
      "sZ": 2393,
      "MH": 2394,
      "w4": 2395,
      "s',": 2396,
      "sz": 2397,
      "UQ": 2398,
      "rG": 2399,
      "oW": 2400,
      "▁_f": 2401,
      "EV": 2402,
      "rm": 2403,
      "kl": 2404,
      "a,": 2405,
      "dV": 2406,
      "n4": 2407,
      "▁VARCHAR\n);": 2408,
      "dt": 2409,
      "FQ": 2410,
      "Eg": 2411,
      "PP": 2412,
      "dg": 2413,
      "Ej": 2414,
      "q0": 2415,
      "OQ": 2416,
      "UW": 2417,
      "yf": 2418,
      "yh": 2419,
      "DK": 2420,
      "MC": 2421,
      "bl": 2422,
      "iW": 2423,
      "▁DECIMAL(10,2)": 2424,
      "v5": 2425,
      "▁'L": 2426,
      "T4": 2427,
      "MJ": 2428,
      "▁'New": 2429,
      "dj": 2430,
      "BW": 2431,
      "y5": 2432,
      "Et": 2433,
      "▁VARCHAR(20)\n);\n\nCREATE": 2434,
      "MX": 2435,
      "uu": 2436,
      "vf": 2437,
      "LK": 2438,
      "wK": 2439,
      "Y5": 2440,
      "AQ": 2441,
      "AW": 2442,
      "nn": 2443,
      "MN": 2444,
      "Yf": 2445,
      "_0": 2446,
      "rh": 2447,
      "3-": 2448,
      "▁'2022-10": 2449,
      "6C": 2450,
      "6J": 2451,
      "Fo": 2452,
      "▁5;": 2453,
      "Dl": 2454,
      "TK": 2455,
      "kk": 2456,
      "32": 2457,
      "HJ": 2458,
      "HR": 2459,
      "Me": 2460,
      "▁_0": 2461,
      "▁3;": 2462,
      "Mp": 2463,
      "Ll": 2464,
      "uJ": 2465,
      "XP": 2466,
      "NJ": 2467,
      "XJ": 2468,
      "Bi": 2469,
      "6P": 2470,
      "r5": 2471,
      "XS": 2472,
      "Y0": 2473,
      "1W": 2474,
      "s5": 2475,
      "nK": 2476,
      "NP": 2477,
      "1Q": 2478,
      "v0": 2479,
      "Tw": 2480,
      "Te": 2481,
      "F9": 2482,
      "D7": 2483,
      "uP": 2484,
      "XC": 2485,
      "HS": 2486,
      "8W": 2487,
      "bK": 2488,
      "L7": 2489,
      "8Q": 2490,
      "rf": 2491,
      "cP": 2492,
      "E4": 2493,
      "uS": 2494,
      "Lk": 2495,
      "Lw": 2496,
      "▁CA": 2497,
      "Xp": 2498,
      "6S": 2499,
      "Dw": 2500,
      "Dk": 2501,
      "uC": 2502,
      "aa": 2503,
      "B9": 2504,
      ".00,": 2505,
      "cJ": 2506,
      "BU": 2507,
      "oo": 2508,
      "Dn": 2509,
      "RJ": 2510,
      "ith',": 2511,
      "HC": 2512,
      "HP": 2513,
      "Ln": 2514,
      "NS": 2515,
      "zG": 2516,
      "RC": 2517,
      "y0": 2518,
      "Np": 2519,
      "je": 2520,
      "RS": 2521,
      "zm": 2522,
      "Ne": 2523,
      "l4": 2524,
      "I9": 2525,
      "Tk": 2526,
      "RP": 2527,
      "3W": 2528,
      "FU": 2529,
      "zx": 2530,
      "3Q": 2531,
      "bk": 2532,
      "Hp": 2533,
      "lK": 2534,
      "Ii": 2535,
      "r0": 2536,
      "s0": 2537,
      "UM(": 2538,
      "Bo": 2539,
      "IA": 2540,
      "BA": 2541,
      "O9": 2542,
      "Dd": 2543,
      "▁GRO": 2544,
      "Zm": 2545,
      "cC": 2546,
      "IU": 2547,
      "Xe": 2548,
      "tt": 2549,
      "Ld": 2550,
      "cS": 2551,
      "▁JSON,\n": 2552,
      "▁GROUP": 2553,
      "bw": 2554,
      "Ia": 2555,
      "Zx": 2556,
      "6p": 2557,
      "hm": 2558,
      "Rp": 2559,
      "▁St": 2560,
      "li": 2561,
      "Io": 2562,
      "ZG": 2563,
      "38": 2564,
      ":00:00',": 2565,
      "▁tot": 2566,
      "Tn": 2567,
      "EK": 2568,
      "▁_Y": 2569,
      "zf": 2570,
      "0.": 2571,
      "bn": 2572,
      "▁(\n_": 2573,
      "▁j_": 2574,
      "▁0_": 2575,
      "7K": 2576,
      "2A": 2577,
      "ci": 2578,
      "qq": 2579,
      "▁1_": 2580,
      "ity": 2581,
      "jV": 2582,
      "▁E_": 2583,
      "▁W_": 2584,
      "vY": 2585,
      "\":": 2586,
      "▁e_": 2587,
      "▁D_": 2588,
      "▁O_": 2589,
      "▁5_": 2590,
      "En": 2591,
      "hx": 2592,
      "2)": 2593,
      "▁y_": 2594,
      "▁m_": 2595,
      "▁p_": 2596,
      "▁l_": 2597,
      "ain": 2598,
      "cp": 2599,
      "lw": 2600,
      "hG": 2601,
      "▁A_": 2602,
      "▁v_": 2603,
      "5f": 2604,
      "▁6_": 2605,
      "▁9_": 2606,
      "▁H_": 2607,
      "▁7_": 2608,
      "▁q_": 2609,
      "▁Z_": 2610,
      "▁x_": 2611,
      "2U": 2612,
      "▁08": 2613,
      "▁i_": 2614,
      "▁I_": 2615,
      "gV": 2616,
      "▁k_": 2617,
      "▁F_": 2618,
      "lk": 2619,
      "▁o_": 2620,
      "Mu": 2621,
      "▁S_": 2622,
      "OA": 2623,
      "▁s_": 2624,
      "Oi": 2625,
      "▁h_": 2626,
      "▁r_": 2627,
      "Oa": 2628,
      "▁R_": 2629,
      "▁z_": 2630,
      "▁K_": 2631,
      "▁f_": 2632,
      "▁g_": 2633,
      "vq": 2634,
      "▁U_": 2635,
      "vy": 2636,
      "▁b_": 2637,
      "▁'R": 2638,
